Repository: amanbayserkeev0377/Tymi
Catalog: Tymi/*.lproj/Localizable.strings
Languages: ru

# alert_delete_habit
source: Delete Habit
ru: Удалить привычку

# alert_delete_habit_message
source: Are you sure you want to delete «%@»?
ru: Вы уверены, что хотите удалить «%@»?

# alert_delete_multiple_habits
source: Delete Selected Habits
ru: Удалить выбранные привычки

# alert_delete_multiple_habits_message
source: Are you sure you want to delete %d selected habits?
ru: Вы уверены, что хотите удалить %d выбранных привычек?

# alert_delete_folder
source: Delete Folder
ru: Удалить папку

# alert_delete_folder_message
source: Delete «%@»? Your habits won't be deleted.
ru: Удалить «%@»? Ваши привычки останутся без изменений.

# alert_delete_folders
source: Delete Folders
ru: Удалить папки

# alert_delete_folders_message
source: Delete %d folders? Your habits won't be deleted.
ru: Удалить %d папок? Ваши привычки останутся без изменений.

# alert_add_count
source: Add Count
ru: Добавить количество

# alert_add_count_message
source: Enter the number of completions to add
ru: Введите количество выполнений для добавления

# alert_add_time
source: Add Time
ru: Добавить время

# alert_add_time_message
source: Enter the time you spent on this habit
ru: Введите время, потраченное на эту привычку

# alert_reset_history
source: Reset History
ru: Сбросить историю

# alert_reset_history_message
source: This will permanently delete all habit completion data. This action cannot be undone.
ru: Это безвозвратно удалит все данные о выполнении привычки. Это действие нельзя отменить.

# alert_close_timer
source: Stop Timer
ru: Остановить таймер

# alert_close_timer_message
source: Closing will stop the running timer. Continue?
ru: Закрытие остановит запущенный таймер. Продолжить?

# alert_notifications_permission
source: Notification Permission Required
ru: Требуется разрешение на уведомления

# alert_notifications_permission_message
source: To receive habit reminders, please enable notifications in Settings.
ru: Для получения напоминаний о привычках включите уведомления в Настройках.

# button_add
source: Add
ru: Добавить

# button_done
source: Done
ru: Готово

# button_delete
source: Delete
ru: Удалить

# button_cancel
source: Cancel
ru: Отмена

# button_close
source: Close
ru: Закрыть

# button_pin
source: Pin
ru: Закрепить

# button_unpin
source: Unpin
ru: Открепить

# button_edit
source: Edit
ru: Изменить

# button_save
source: Save
ru: Сохранить

# button_reset
source: Reset
ru: Сбросить

# button_reset_progress
source: Reset progress
ru: Сбросить прогресс

source: Complete
ru: Выполнить

source: Completed
ru: Выполнено

source: Today
ru: Сегодня

source: Yesterday
ru: Вчера

# items_selected
source: %d Selected
ru: %d выбрано

source: Count
ru: Количество

source: Time
ru: Время

source: times
ru: раз

source: Hours
ru: Часы

source: Goal: %@
ru: Цель: %@

# minutes_format
source: %d m
ru: %d м

# hours_format
source: %d hr
ru: %d ч

source: hours (less than 24)
ru: часы (меньше 24)

# hours_minutes_format
source: %d hr %d m
ru: %d ч %d м

source: Minutes
ru: Минуты

source: minutes (less than 60)
ru: минуты (меньше 60)

source: Total
ru: Всего

source: version
ru: версия

source: Home
ru: Главная

source: Statistics
ru: Статистика

source: Settings
ru: Настройки

source: Habit Name
ru: Название привычки

source: Icon
ru: Иконка

# goalsection_choose_time
source: Choose time (hr:min)
ru: Выберите время (ч:м)

# goalsection_enter_count
source: Enter count
ru: Введите число

source: Active days
ru: Активные дни

source: Everyday
ru: Ежедневно

source: Every week
ru: Еженедельно

source: Select days
ru: Выберите дни

# will_repeat_weekly
source: Will repeat weekly on these days
ru: Будет повторяться еженедельно в эти дни

source: Reminders
ru: Напоминания

source: Reminder
ru: Напоминание

source: Add Count
ru: Добавить количество

source: Add progress
ru: Добавить прогресс

# add_reminder
source: Add
ru: Добавить

source: Add Time
ru: Добавить время

source: Choose Icon
ru: Выбрать иконку

source: Create Habit
ru: Создать привычку

# daily_goal
source: Goal
ru: Цель

source: Delete habit
ru: Удалить привычку

source: Edit Habit
ru: Редактировать

# future_self_thank_you
source: Tap '+' to add your first habit.
ru: Нажмите “+” чтобы создать свою первую привычку.

# goal_format
source: Goal: %@
ru: Цель: %@

source: Habits
ru: Привычки

source: Health
ru: Здоровье

source: Hobbies
ru: Хобби

source: Lifestyle
ru: Образ жизни

source: Loading calendar…
ru: Календарь загружается…

# no_habits
source: You don't have any habits yet.
ru: У вас пока нет привычек.

# no_habits_for_date
source: No habits for this date
ru: В этот день у вас нет привычек

source: No icon
ru: Без иконки

source: Productivity
ru: Продуктивность

# reset_all_history
source: Reset history
ru: Сбросить историю

# reset_button_label
source: Reset
ru: Сброс

source: Start date
ru: Дата начала

source: Streak
ru: Подряд

# notifications_habit_time
source: Time for your habit!
ru: Время для привычки!

# notifications_dont_forget
source: Don't forget to do: %@
ru: Не забудьте выполнить: %@

# settings_header_appearance
source: Appearance & Language
ru: Внешний вид и язык

# settings_header_data
source: Data & Organization
ru: Данные и организация

# settings_header_sounds_feedback
source: Sounds & Feedback
ru: Звуки и отклик

# settings_header_support
source: Support & Feedback
ru: Поддержка и обратная связь

# settings_header_legal
source: Legal
ru: Правовая информация

# settings_footer_language
source: You can change the app language in the system settings.
ru: Язык приложения можно изменить в системных настройках.

source: App Color
ru: Цвет приложения

# app_color_preview_header
source: Preview
ru: Предпросмотр

# app_color_preview_footer
source: The app color changes according to your selected color.
ru: Цвет приложения изменяется в зависимости от выбранного вами цвета.

# app_color_colors_header
source: Colors
ru: Цвета

source: App Icon
ru: Иконка приложения

# app_icon_aura_name
source: Aura
ru: Аура

# app_icon_blaze_name
source: Blaze
ru: Пламя

# app_icon_bliss_name
source: Bliss
ru: Блаженство

# app_icon_chill_name
source: Chill
ru: Спокойствие

# app_icon_dark_name
source: Dark
ru: Тёмная

# app_icon_dream_name
source: Dream
ru: Мечта

# app_icon_light_name
source: Light
ru: Светлая

# app_icon_main_name
source: Main
ru: Основная

# app_icon_minimal_dark_name
source: Minimal Dark
ru: Тёмный минимализм

# app_icon_minimal_light_name
source: Minimal Light
ru: Светлый минимализм

# app_icon_paper_name
source: Paper
ru: Бумага

# app_icon_silver_blue_name
source: Silver Blue
ru: Металлик Блюз

# app_icon_sunrise_name
source: Sunrise
ru: Восход

source: Appearance
ru: Внешний вид

# appearance_dark
source: Dark
ru: Тёмный

# appearance_light
source: Light
ru: Светлый

# appearance_system
source: System
ru: Системный

# week_start_day
source: Week Start
ru: Начало недели

# week_start_system
source: System
ru: Как в системе

source: Language
ru: Язык

source: Archive
ru: Архивировать

source: Archived Habits
ru: Архив

source: No Archived Habits
ru: Нет архивированных привычек

source: Unarchive
ru: Разархивировать

# archived_habits_footer
source: Swipe left to unarchive or delete
ru: Смахните влево для разархивирования или удаления

# archived_date_format
source: Archived %@
ru: Архивировано %@

source: Folders
ru: Папки

# folders_all
source: All
ru: Все

# folders_move
source: Move
ru: Переместить

# folders_new_folder
source: New Folder
ru: Новая папка

# folders_edit_folder
source: Edit Folder
ru: Редактировать папку

# folders_create_folder
source: Create a Folder
ru: Создать папку

# folders_select_folder
source: Select a Folder
ru: Выберите папку

# folders_folder_name
source: Folder Name
ru: Название папки

# folders_edit_footer
source: Tap 'Edit' to change the order or delete folders. Folder management is also available in the Settings.
ru: Нажмите «Редактировать» для изменения порядка или удаления папок. Управление папками также доступно в настройках.

# folders_none_selected
source: None
ru: Нет

# folders_move_to_folder
source: Move to folder
ru: Переместить в папку

# folders_no_folder
source: No folder
ru: Без папки

# folders_no_habits
source: No habits in this folder
ru: В этой папке нет привычек

source: iCloud Sync
ru: iCloud синхронизация

# icloud_sync_status
source: Sync Status
ru: Статус синхронизации

# icloud_sync_active
source: Active
ru: Активна

# icloud_checking_status
source: Checking...
ru: Проверка...

# icloud_not_signed_in
source: Sign in to iCloud
ru: Войдите в iCloud

# icloud_restricted
source: iCloud is Restricted
ru: iCloud ограничен

# icloud_how_sync_works
source: How Sync Works
ru: Как работает синхронизация

# icloud_automatic_backup
source: Automatic Backup
ru: Автоматическое сохранение

# icloud_automatic_backup_desc
source: All habits are automatically saved to your iCloud
ru: Все привычки автоматически сохраняются в вашем iCloud

# icloud_cross_device_sync
source: Cross-Device Sync
ru: Синхронизация устройств

# icloud_cross_device_sync_desc
source: Access your habits on iPhone, iPad, and other devices
ru: Доступ к привычкам с iPhone, iPad и других устройств

# icloud_private_secure
source: Privacy & Security
ru: Приватность и безопасность

# icloud_private_secure_desc
source: Data is stored only in your personal iCloud
ru: Данные хранятся только в вашем личном iCloud

# icloud_troubleshooting
source: Troubleshooting
ru: Решение проблем

# icloud_signin_required
source: iCloud sign-in is required for syncing
ru: Для синхронизации требуется вход в iCloud

# icloud_signin_steps
source: Settings → [Your Name] → iCloud → Sign In
ru: Настройки → [Ваше имя] → iCloud → Войти

# icloud_status_unknown
source: Status Unknown
ru: Статус неизвестен

# icloud_temporarily_unavailable
source: Temporarily Unavailable
ru: Временно недоступен

# icloud_unknown_error
source: Unknown Error
ru: Неизвестная ошибка

# icloud_check_failed
source: Check Failed
ru: Проверка не удалась

source: Notifications
ru: Уведомления

source: Haptics
ru: Виброотклик

source: Rate App
ru: Оценить

source: Share App
ru: Поделиться

source: Contact Developer
ru: Связаться с разработчиком

# report_bug
source: Report a Bug
ru: Сообщить об ошибке

source: Terms of Service
ru: Условия использования

# tos_intro_title
source: Thank you for choosing Tymi!
ru: Спасибо, что выбрали Tymi!

# tos_intro_body
source: This app is created for personal use to help you track your habits. By using Tymi, you agree to the following terms:
ru: Это приложение создано для личного использования, чтобы помочь вам отслеживать свои привычки. Используя Tymi, вы соглашаетесь с следующими условиями:

# tos_privacy_title
source: Privacy and Data
ru: Конфиденциальность и данные

# tos_privacy_body
source: The app stores your data locally and may sync it through iCloud when you're signed in. We do not collect, analyze, or share your personal data with third parties. For detailed information, please see our Privacy Policy.
ru: Приложение хранит данные локально и может синхронизировать их через iCloud при входе в систему. Мы не собираем, не анализируем и не передаём ваши личные данные третьим лицам. Подробности в нашей Политике конфиденциальности.

# tos_icloud_title
source: iCloud Integration
ru: Интеграция с iCloud

# tos_icloud_body
source: When signed into iCloud, your habit data automatically syncs across your Apple devices. This data is stored in your private iCloud container and is governed by Apple's Terms of Service and Privacy Policy.
ru: При входе в iCloud данные привычек автоматически синхронизируются между устройствами Apple. Данные хранятся в вашем личном контейнере iCloud и регулируются Условиями и Политикой конфиденциальности Apple.

# tos_risk_title
source: Use at Your Own Risk
ru: Использование на ваш страх и риск

# tos_risk_body
source: You use the app at your own risk. While we strive to provide a reliable service, we are not responsible for data loss, sync issues, or other possible technical problems.
ru: Вы используете приложение на свой страх и риск. Мы стремимся обеспечить надёжную работу, но не несём ответственности за потерю данных, проблемы с синхронизацией или другие технические неполадки.

# tos_updates_title
source: Updates
ru: Обновления

# tos_updates_body
source: We may periodically update the app and these terms to improve functionality and user experience. Continued use of the app constitutes acceptance of any updates.
ru: Мы можем периодически обновлять приложение и условия для улучшения функциональности и пользовательского опыта. Продолжение использования приложения означает согласие с обновлениями.

# tos_warranty_title
source: No Warranty
ru: Отсутствие гарантий

# tos_warranty_body
source: The app is provided 'as is' without warranties of any kind. While we work to ensure everything functions properly, we cannot guarantee perfect accuracy or uninterrupted service.
ru: Приложение предоставляется «как есть» без каких-либо гарантий. Мы стараемся обеспечить правильную работу, но не можем гарантировать идеальную точность или бесперебойное функционирование.

# tos_contact_title
source: Contact
ru: Связь

# tos_contact_body
source: If you have any questions about these terms or the app, feel free to contact us:
ru: Если у вас есть вопросы по условиям или приложению, не стесняйтесь связаться с нами:

# tos_contact_email_label
source: Email
ru: Электронная почта

source: Privacy Policy
ru: Политика конфиденциальности

# privacy_updated_title
source: Last Updated
ru: Дата обновления

# privacy_updated_date
source: Last updated: May 28, 2025
ru: Обновлено: 28 мая 2025 г.

# privacy_intro_title
source: Introduction
ru: Введение

# privacy_intro_body
source: The Tymi habit tracking app respects user privacy. This section describes what data is used, where it is stored, and how it is processed.
ru: Приложение Tymi для отслеживания привычек уважает конфиденциальность пользователей. В этом разделе описывается, какие данные используются, где они хранятся и как обрабатываются.

# privacy_data_title
source: Collected Information
ru: Собираемая информация

# privacy_data_body
source: The app uses the following information:
ru: Приложение использует следующую информацию:

# privacy_data_item_1
source: • Habit data — names, goals, progress, and user-defined parameters
ru: • Данные привычек — названия, цели, прогресс и заданные пользователем параметры

# privacy_data_item_2
source: • App settings — theme, week start, and other preferences
ru: • Настройки приложения — тема, начало недели и другие предпочтения

# privacy_data_item_3
source: • Performance statistics — dates, times, and habit progress trends
ru: • Статистика использования — даты, время и динамика выполнения привычек

# privacy_storage_title
source: Data Storage
ru: Хранение данных

# privacy_storage_body
source: The app stores data using the following methods:
ru: Данные хранятся с использованием следующих методов:

# privacy_storage_item_1
source: • Local storage using SwiftData for habits and progress data
ru: • Локальное хранилище через SwiftData для данных привычек и прогресса

# privacy_storage_item_2
source: • UserDefaults for app settings and preferences
ru: • UserDefaults для настроек приложения и предпочтений

# privacy_storage_item_3
source: • Automatic iCloud synchronization through CloudKit for signed-in users
ru: • Автоматическая синхронизация с iCloud через CloudKit для авторизованных пользователей

# privacy_storage_implication
source: This storage approach means:
ru: Такой подход к хранению данных означает:

# privacy_storage_implication_1
source: • Local data is always stored securely on your device
ru: • Локальные данные всегда хранятся безопасно на устройстве

# privacy_storage_implication_2
source: • iCloud sync happens automatically when signed into iCloud
ru: • Синхронизация с iCloud происходит автоматически при входе в iCloud

# privacy_storage_implication_3
source: • You maintain full control over your data through your Apple ID
ru: • Полный контроль над данными осуществляется через Apple ID

# privacy_storage_implication_4
source: • Deleting the app removes local data; iCloud data can be managed through Apple ID settings
ru: • Удаление приложения удаляет локальные данные; данные в iCloud можно управлять через настройки Apple ID

# privacy_icloud_title
source: iCloud Synchronization
ru: Синхронизация с iCloud

# privacy_icloud_body
source: The app automatically syncs data via iCloud when available:
ru: При наличии доступа приложение автоматически синхронизирует данные через iCloud:

# privacy_icloud_item_1
source: • Habit data synchronizes across all your Apple devices
ru: • Данные привычек синхронизируются между всеми устройствами Apple

# privacy_icloud_item_2
source: • Data is stored in your private iCloud container
ru: • Данные хранятся в личном контейнере iCloud

# privacy_icloud_item_3
source: • Only accessible through your Apple ID
ru: • Доступ возможен только через Apple ID

# privacy_icloud_item_4
source: • Governed by Apple's iCloud Terms and Privacy Policy
ru: • Применяются условия и политика конфиденциальности iCloud от Apple

# privacy_icloud_item_5
source: • If not signed into iCloud, data remains local only
ru: • При отсутствии входа в iCloud данные остаются только на устройстве

# privacy_notifications_title
source: Notifications
ru: Уведомления

# privacy_notifications_body
source: If permitted, the app may send local habit reminders:
ru: При разрешении приложение может отправлять локальные напоминания о привычках:

# privacy_notifications_item_1
source: • Notifications are configured by the user
ru: • Уведомления настраиваются пользователем

# privacy_notifications_item_2
source: • Can be disabled at any time through settings
ru: • Их можно отключить в любой момент через настройки

# privacy_notifications_item_3
source: • Processed locally and not shared with third-party services
ru: • Обрабатываются локально и не передаются сторонним сервисам

# privacy_collection_title
source: Data Collection and Sharing
ru: Сбор и передача данных

# privacy_collection_body
source: The app does not collect or share data with third parties:
ru: Приложение не собирает и не передаёт данные третьим лицам:

# privacy_collection_item_1
source: • No usage analytics
ru: • Без аналитики использования

# privacy_collection_item_2
source: • No behavior tracking
ru: • Без отслеживания поведения

# privacy_collection_item_3
source: • No data sharing with third parties
ru: • Без передачи данных третьим сторонам

# privacy_collection_item_4
source: • No advertising trackers or third-party SDKs
ru: • Без рекламных трекеров и сторонних SDK

# privacy_collection_item_5
source: • iCloud data (when synced) is stored in Apple's secure infrastructure
ru: • Данные iCloud (при синхронизации) хранятся в защищённой инфраструктуре Apple

# privacy_security_title
source: Security
ru: Безопасность

# privacy_security_item_1
source: • Data is stored in secure iOS containers and iCloud (when enabled)
ru: • Данные хранятся в защищённых контейнерах iOS и в iCloud (при активации)

# privacy_security_item_2
source: • iCloud data is protected by Apple's encryption and security measures
ru: • Данные в iCloud защищены средствами шифрования и безопасности Apple

# privacy_apple_title
source: Apple Services
ru: Сервисы Apple

# privacy_apple_body
source: When using iCloud sync, data processing is governed by Apple's Privacy Policy. We do not have access to your iCloud data.
ru: При использовании синхронизации iCloud обработка данных регулируется политикой конфиденциальности Apple. Доступ к данным iCloud отсутствует.

# privacy_children_title
source: Children's Privacy
ru: Конфиденциальность детей

# privacy_children_body
source: The app is not specifically designed for children under 13, but it is safe for users of all ages.
ru: Приложение не предназначено специально для детей младше 13 лет, но безопасно для пользователей любого возраста.

# privacy_changes_title
source: Policy Updates
ru: Обновления политики

# privacy_changes_body
source: The policy may be updated. It is recommended to periodically check this page. Updates take effect upon publication.
ru: Политика может обновляться. Рекомендуется периодически проверять этот раздел. Обновления вступают в силу с момента публикации.

# privacy_contact_title
source: Contact Information
ru: Контактная информация

# privacy_contact_body
source: For questions or suggestions regarding privacy, you can contact:
ru: По вопросам или предложениям, связанным с конфиденциальностью, можно связаться по:

# privacy_contact_email_label
source: Email
ru: Электронная почта

source: Made with
ru: Сделано с

source: in Kyrgyzstan
ru: в Кыргызстане

# empty_view_largetitle
source: Start Today, Grow Tomorrow
ru: Начни сегодня, расти завтра

# empty_view_title3
source: Step by Step
ru: Шаг за шагом

# empty_view_tap
source: Tap
ru: Нажмите

# empty_view_to_create_habit
source: to create your first habit
ru: чтобы создать свою первую привычку
